[Killed] Block
js_app/api/albums/albums.controller.js:5:37
 
 const getAlbum = (req) => album(req.params.id);
 
-const getAllAlbums = async (req) => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allAlbums({field, value})
-};
+const getAllAlbums = async (req) => {};
 
 module.exports = {getAllAlbums, getAlbum};

[Killed] ConditionalExpression
js_app/api/albums/albums.controller.js:6:17
 const getAlbum = (req) => album(req.params.id);
 
 const getAllAlbums = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = false;
   const value = req && req.query && req.query.value;
   return allAlbums({field, value})

[Killed] ConditionalExpression
js_app/api/albums/albums.controller.js:6:17
 const getAlbum = (req) => album(req.params.id);
 
 const getAllAlbums = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = false && req.query.field;
   const value = req && req.query && req.query.value;
   return allAlbums({field, value})

[Killed] BinaryExpression
js_app/api/albums/albums.controller.js:7:17
 
 const getAllAlbums = async (req) => {
   const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
+  const value = req || req.query && req.query.value;
   return allAlbums({field, value})
 };

[Killed] ConditionalExpression
js_app/api/albums/albums.controller.js:7:17
 
 const getAllAlbums = async (req) => {
   const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
+  const value = false;
   return allAlbums({field, value})
 };
