[Killed] Block
js_app/api/albums/albums.model.js:5:21
 const {filterByValue, findValueByKeyInObject} = require('../../utils');
 const albumFormat = require('../../utils/formats').album;
 
-const album = id => {
-  return client.getAlbum(id)
-};
+const album = id => {};
 
 const allAlbums = async ({field, value}) => {

[Killed] Block
js_app/api/albums/albums.model.js:9:45
   return client.getAlbum(id)
 };
 
-const allAlbums = async ({field, value}) => {
-  const albums = await client.getAllAlbums();
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const byFieldValue = filterByValue({field, value}, albumFormat);
-
-  if (byFieldValue) {
-    const response = albums.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  albums
-  }
-};
+const allAlbums = async ({field, value}) => {};
 
 module.exports = {album, allAlbums};

[Killed] ConditionalExpression
js_app/api/albums/albums.model.js:12:29
 const allAlbums = async ({field, value}) => {
   const albums = await client.getAllAlbums();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((field && !value) || (true)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] IfStatement
js_app/api/albums/albums.model.js:12:7
 const allAlbums = async ({field, value}) => {
   const albums = await client.getAllAlbums();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if (false) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] IfStatement
js_app/api/albums/albums.model.js:14:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (false) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, albumFormat);

[Killed] ConditionalExpression
js_app/api/albums/albums.model.js:14:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (false && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, albumFormat);

[Killed] ObjectLiteral
js_app/api/albums/albums.model.js:16:38
 
   if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
-  const byFieldValue = filterByValue({field, value}, albumFormat);
+  const byFieldValue = filterByValue({}, albumFormat);
 
   if (byFieldValue) {

[Killed] Block
js_app/api/albums/albums.model.js:18:21
 
   const byFieldValue = filterByValue({field, value}, albumFormat);
 
-  if (byFieldValue) {
-    const response = albums.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
+  if (byFieldValue) {} else {
     return  albums
   }

[Killed] IfStatement
js_app/api/albums/albums.model.js:18:7
 
   const byFieldValue = filterByValue({field, value}, albumFormat);
 
-  if (byFieldValue) {
+  if (false) {
     const response = albums.filter(byFieldValue);
 

[Killed] IfStatement
js_app/api/albums/albums.model.js:21:9
   if (byFieldValue) {
     const response = albums.filter(byFieldValue);
 
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
+    if (true) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 

[Killed] BinaryExpression
js_app/api/albums/albums.model.js:21:9
   if (byFieldValue) {
     const response = albums.filter(byFieldValue);
 
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
+    if (response.length !== 0) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 

[Killed] Block
js_app/api/albums/albums.model.js:24:10
     if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 
-  } else {
-    return  albums
-  }
+  } else {}
 };
 

[Killed] ObjectLiteral
js_app/api/albums/albums.model.js:29:18
   }
 };
 
-module.exports = {album, allAlbums};
+module.exports = {};
