[Killed] StringLiteral
js_app/api/albums/albums.routes.js:7:12
 
 const router = express.Router();
 
-router.get('/', respond(getAllAlbums));
+router.get("", respond(getAllAlbums));
 router.get('/:id', respond(getAlbum));
 
