[Killed] StringLiteral
js_app/api/comments/comments.client.js:7:39
 
 const client = axios.create(endpoint);
 
-const getComment = (id) => client.get(`/${id}`).then(getData);
+const getComment = (id) => client.get("").then(getData);
 const getAllComments = () => client.get('/').then(getData);
 

[Killed] ObjectLiteral
js_app/api/comments/comments.client.js:10:18
 const getComment = (id) => client.get(`/${id}`).then(getData);
 const getAllComments = () => client.get('/').then(getData);
 
-module.exports = {getComment, getAllComments};
+module.exports = {};
