[Killed] Block
js_app/api/comments/comments.controller.js:5:38
 
 const getComment = (req) => comment(req.params.id);
 
-const getAllComments= async (req) => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allComments({field, value})
-};
+const getAllComments= async (req) => {};
 
 module.exports = {getAllComments, getComment};

[Killed] BinaryExpression
js_app/api/comments/comments.controller.js:6:17
 const getComment = (req) => comment(req.params.id);
 
 const getAllComments= async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = req || req.query && req.query.field;
   const value = req && req.query && req.query.value;
   return allComments({field, value})

[Killed] ConditionalExpression
js_app/api/comments/comments.controller.js:6:17
 const getComment = (req) => comment(req.params.id);
 
 const getAllComments= async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = true;
   const value = req && req.query && req.query.value;
   return allComments({field, value})

[Killed] ConditionalExpression
js_app/api/comments/comments.controller.js:7:17
 
 const getAllComments= async (req) => {
   const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
+  const value = false && req.query.value;
   return allComments({field, value})
 };

[Killed] ObjectLiteral
js_app/api/comments/comments.controller.js:8:22
 const getAllComments= async (req) => {
   const field = req && req.query && req.query.field;
   const value = req && req.query && req.query.value;
-  return allComments({field, value})
+  return allComments({})
 };
 
