[Killed] Block
js_app/api/comments/comments.model.js:8:51
 
 const comment = client.getComment;
 
-const userComments = async ({comments, value}) => {
-  const user = await usersModel.user(value);
-  const filter = {
-    value: user.email,
-    field: 'email'
-  };
-  return comments.filter(filterByValue(filter, commentFormat))
-};
+const userComments = async ({comments, value}) => {};
 
 const allComments = async ({field, value}) => {

[Killed] Block
js_app/api/comments/comments.model.js:17:47
   return comments.filter(filterByValue(filter, commentFormat))
 };
 
-const allComments = async ({field, value}) => {
-  const comments = await client.getAllComments();
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  if (field === 'userId') return userComments({comments, value});
-
-  if (field && value && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const byFieldValue = filterByValue({field, value}, commentFormat);
-
-  if (byFieldValue) {
-    const response = comments.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  comments
-  }
-};
+const allComments = async ({field, value}) => {};
 
 module.exports = {comment, allComments};

[Killed] IfStatement
js_app/api/comments/comments.model.js:20:7
 const allComments = async ({field, value}) => {
   const comments = await client.getAllComments();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if (true) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field === 'userId') return userComments({comments, value});

[Killed] BinaryExpression
js_app/api/comments/comments.model.js:20:8
 const allComments = async ({field, value}) => {
   const comments = await client.getAllComments();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((field || !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field === 'userId') return userComments({comments, value});

[Killed] BinaryExpression
js_app/api/comments/comments.model.js:22:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field === 'userId') return userComments({comments, value});
+  if (field !== 'userId') return userComments({comments, value});
 
   if (field && value && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] IfStatement
js_app/api/comments/comments.model.js:22:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field === 'userId') return userComments({comments, value});
+  if (true) return userComments({comments, value});
 
   if (field && value && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] ConditionalExpression
js_app/api/comments/comments.model.js:24:7
 
   if (field === 'userId') return userComments({comments, value});
 
-  if (field && value && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (false && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, commentFormat);

[Killed] IfStatement
js_app/api/comments/comments.model.js:24:7
 
   if (field === 'userId') return userComments({comments, value});
 
-  if (field && value && !findValueByKeyInObject(commentFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (false) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, commentFormat);

[Killed] Block
js_app/api/comments/comments.model.js:28:21
 
   const byFieldValue = filterByValue({field, value}, commentFormat);
 
-  if (byFieldValue) {
-    const response = comments.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
+  if (byFieldValue) {} else {
     return  comments
   }

[Killed] IfStatement
js_app/api/comments/comments.model.js:28:7
 
   const byFieldValue = filterByValue({field, value}, commentFormat);
 
-  if (byFieldValue) {
+  if (true) {
     const response = comments.filter(byFieldValue);
 

[Killed] IfStatement
js_app/api/comments/comments.model.js:31:9
   if (byFieldValue) {
     const response = comments.filter(byFieldValue);
 
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
+    if (false) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 

[Killed] Block
js_app/api/comments/comments.model.js:34:10
     if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 
-  } else {
-    return  comments
-  }
+  } else {}
 };
 
