[Killed] ObjectLiteral
entrevista_wolox/js_app/api/controller.js:1:20
-const httpStatus = {
-  'not_found':404,
-  'bad_format':400
-};
+const httpStatus = {};
 
 module.exports = fn => (req, res) => Promise.all([fn(req)])

[Killed] StringLiteral
entrevista_wolox/js_app/api/controller.js:3:3
 const httpStatus = {
   'not_found':404,
-  'bad_format':400
+  "":400
 };
 

[Killed] Block
entrevista_wolox/js_app/api/controller.js:7:23
 };
 
 module.exports = fn => (req, res) => Promise.all([fn(req)])
-  .then(([result]) => {
-    res.json(result)
-  })
+  .then(([result]) => {})
   .catch(error => {
     console.error(error);

[Killed] Block
entrevista_wolox/js_app/api/controller.js:10:19
   .then(([result]) => {
     res.json(result)
   })
-  .catch(error => {
-    console.error(error);
-    res.status(httpStatus[error.code] || (error && error.response && error.response.status) || 500);
-    res.json({msg: error.message})
-  });
+  .catch(error => {});

[Killed] ConditionalExpression
entrevista_wolox/js_app/api/controller.js:12:43
   })
   .catch(error => {
     console.error(error);
-    res.status(httpStatus[error.code] || (error && error.response && error.response.status) || 500);
+    res.status(httpStatus[error.code] || (false) || 500);
     res.json({msg: error.message})
   });

[Killed] ConditionalExpression
entrevista_wolox/js_app/api/controller.js:12:43
   })
   .catch(error => {
     console.error(error);
-    res.status(httpStatus[error.code] || (error && error.response && error.response.status) || 500);
+    res.status(httpStatus[error.code] || (false && error.response.status) || 500);
     res.json({msg: error.message})
   });
