[Killed] Block
entrevista_wolox/js_app/api/index.js:4:26
 const express = require('express');
 const {users, photos, albums, posts, comments, sharedAlbums} = require('./routes');
 
-module.exports = (db) => {
-  const router = express.Router();
-  router.use('/users', users);
-  router.use('/photos', photos);
-  router.use('/albums', albums);
-  router.use ('/posts', posts);
-  router.use('/comments', comments);
-  router.use('/sharedAlbums', sharedAlbums(db));
-
-  return router;
-};
+module.exports = (db) => {};

[Killed] StringLiteral
entrevista_wolox/js_app/api/index.js:8:14
   const router = express.Router();
   router.use('/users', users);
   router.use('/photos', photos);
-  router.use('/albums', albums);
+  router.use("", albums);
   router.use ('/posts', posts);
   router.use('/comments', comments);

[Killed] StringLiteral
entrevista_wolox/js_app/api/index.js:9:15
   router.use('/users', users);
   router.use('/photos', photos);
   router.use('/albums', albums);
-  router.use ('/posts', posts);
+  router.use ("", posts);
   router.use('/comments', comments);
   router.use('/sharedAlbums', sharedAlbums(db));
