[Killed] StringLiteral
js_app/api/photos/photos.client.js:7:37
 
 const client = axios.create(endpoint);
 
-const getPhoto = (id) => client.get(`/${id}`).then(getData);
+const getPhoto = (id) => client.get("").then(getData);
 const getAllPhotos = () => client.get('/').then(getData);
 

[Killed] ObjectLiteral
js_app/api/photos/photos.client.js:10:18
 const getPhoto = (id) => client.get(`/${id}`).then(getData);
 const getAllPhotos = () => client.get('/').then(getData);
 
-module.exports = {getPhoto, getAllPhotos};
+module.exports = {};
