[Killed] Block
js_app/api/photos/photos.controller.js:5:37
 
 const getPhoto = (req) => photo(req.params.id);
 
-const getAllPhotos = async (req) => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allPhotos({field, value})
-};
+const getAllPhotos = async (req) => {};
 
 module.exports = {getAllPhotos, getPhoto};

[Killed] BinaryExpression
js_app/api/photos/photos.controller.js:6:17
 const getPhoto = (req) => photo(req.params.id);
 
 const getAllPhotos = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = req || req.query && req.query.field;
   const value = req && req.query && req.query.value;
   return allPhotos({field, value})

[Killed] ConditionalExpression
js_app/api/photos/photos.controller.js:6:17
 const getPhoto = (req) => photo(req.params.id);
 
 const getAllPhotos = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = false;
   const value = req && req.query && req.query.value;
   return allPhotos({field, value})

[Killed] BinaryExpression
js_app/api/photos/photos.controller.js:7:17
 
 const getAllPhotos = async (req) => {
   const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
+  const value = req && req.query || req.query.value;
   return allPhotos({field, value})
 };

[Killed] ConditionalExpression
js_app/api/photos/photos.controller.js:7:17
 
 const getAllPhotos = async (req) => {
   const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
+  const value = true;
   return allPhotos({field, value})
 };
