[Killed] ObjectLiteral
js_app/api/photos/photos.endpoint.js:3:18
 const config = require('../../config');
 
-module.exports = {
-  baseURL: `${config.jsonplaceholder.domain}/photos`,
-  timeout: 5000
-};
+module.exports = {};

[Killed] StringLiteral
js_app/api/photos/photos.endpoint.js:4:12
 const config = require('../../config');
 
 module.exports = {
-  baseURL: `${config.jsonplaceholder.domain}/photos`,
+  baseURL: "",
   timeout: 5000
 };
