[Killed] Block
js_app/api/photos/photos.filter.js:5:52
 const photoFormat = require('../../utils/formats').photo;
 const albumsService = require('../albums/albums.model');
 
-const userPhotos = async (photos, field, value) => {
-  const userAlbums = await albumsService.allAlbums({field, value});
-
-  return userAlbums.reduce((result, album) => {
-    return result.concat(photos.filter(filterByValue({field: 'albumId', value: album.id}, photoFormat)))
-  }, [])
-};
+const userPhotos = async (photos, field, value) => {};
 
 const filterPhotos = (field, value, photos) => {

[NoCoverage] ObjectLiteral
js_app/api/photos/photos.filter.js:6:52
 const albumsService = require('../albums/albums.model');
 
 const userPhotos = async (photos, field, value) => {
-  const userAlbums = await albumsService.allAlbums({field, value});
+  const userAlbums = await albumsService.allAlbums({});
 
   return userAlbums.reduce((result, album) => {

[NoCoverage] Block
js_app/api/photos/photos.filter.js:8:47
 const userPhotos = async (photos, field, value) => {
   const userAlbums = await albumsService.allAlbums({field, value});
 
-  return userAlbums.reduce((result, album) => {
-    return result.concat(photos.filter(filterByValue({field: 'albumId', value: album.id}, photoFormat)))
-  }, [])
+  return userAlbums.reduce((result, album) => {}, [])
 };
 

[Killed] Block
js_app/api/photos/photos.filter.js:13:48
   }, [])
 };
 
-const filterPhotos = (field, value, photos) => {
-  // Filter by User
-  if (field === 'userId') return userPhotos(photos, field, value);
-
-  // Generic filter
-  if (field && value && !findValueByKeyInObject(photoFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const filter = filterByValue({field, value}, photoFormat);
-
-  if (filter) {
-    const response = photos.filter(filter);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  photos
-  }
-};
+const filterPhotos = (field, value, photos) => {};
 
 module.exports = {

[Killed] IfStatement
js_app/api/photos/photos.filter.js:15:7
 
 const filterPhotos = (field, value, photos) => {
   // Filter by User
-  if (field === 'userId') return userPhotos(photos, field, value);
+  if (false) return userPhotos(photos, field, value);
 
   // Generic filter

[Killed] IfStatement
js_app/api/photos/photos.filter.js:15:7
 
 const filterPhotos = (field, value, photos) => {
   // Filter by User
-  if (field === 'userId') return userPhotos(photos, field, value);
+  if (true) return userPhotos(photos, field, value);
 
   // Generic filter

[Killed] PrefixUnaryExpression
js_app/api/photos/photos.filter.js:18:25
   if (field === 'userId') return userPhotos(photos, field, value);
 
   // Generic filter
-  if (field && value && !findValueByKeyInObject(photoFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (field && value && findValueByKeyInObject(photoFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const filter = filterByValue({field, value}, photoFormat);

[Killed] IfStatement
js_app/api/photos/photos.filter.js:18:7
   if (field === 'userId') return userPhotos(photos, field, value);
 
   // Generic filter
-  if (field && value && !findValueByKeyInObject(photoFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (false) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const filter = filterByValue({field, value}, photoFormat);

[Killed] ObjectLiteral
js_app/api/photos/photos.filter.js:20:32
   // Generic filter
   if (field && value && !findValueByKeyInObject(photoFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
-  const filter = filterByValue({field, value}, photoFormat);
+  const filter = filterByValue({}, photoFormat);
 
   if (filter) {

[Killed] IfStatement
js_app/api/photos/photos.filter.js:22:7
 
   const filter = filterByValue({field, value}, photoFormat);
 
-  if (filter) {
+  if (false) {
     const response = photos.filter(filter);
 

[Killed] Block
js_app/api/photos/photos.filter.js:22:15
 
   const filter = filterByValue({field, value}, photoFormat);
 
-  if (filter) {
-    const response = photos.filter(filter);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
+  if (filter) {} else {
     return  photos
   }

[Killed] Block
js_app/api/photos/photos.filter.js:28:10
     if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 
-  } else {
-    return  photos
-  }
+  } else {}
 };
 
