[Killed] StringLiteral
js_app/api/photos/photos.routes.js:7:12
 
 const router = express.Router();
 
-router.get('/', respond(getAllPhotos));
+router.get("", respond(getAllPhotos));
 router.get('/:id', respond(getPhoto));
 
