[Killed] Block
js_app/api/photos/photos.services.js:6:45
 
 const photo = client.getPhoto;
 
-const allPhotos = async ({field, value}) => {
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  const photos = await client.getAllPhotos();
-
-  return filterPhotos(field, value, photos);
-};
+const allPhotos = async ({field, value}) => {};
 
 module.exports = {photo, allPhotos};

[Killed] ConditionalExpression
js_app/api/photos/photos.services.js:8:8
 
 const allPhotos = async ({field, value}) => {
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((true) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   const photos = await client.getAllPhotos();

[Killed] ObjectLiteral
js_app/api/photos/photos.services.js:15:18
   return filterPhotos(field, value, photos);
 };
 
-module.exports = {photo, allPhotos};
+module.exports = {};
