[Killed] ObjectLiteral
js_app/api/posts/posts.client.js:10:18
 const getPost = (id) => client.get(`/${id}`).then(getData);
 const getAllPosts = () => client.get('/').then(getData);
 
-module.exports = {getPost, getAllPosts};
+module.exports = {};
