[Killed] Block
js_app/api/posts/posts.controller.js:5:36
 
 const getPost = (req) => post(req.params.id);
 
-const getAllPosts = async (req) => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allPosts({field, value})
-};
+const getAllPosts = async (req) => {};
 
 module.exports = {getAllPosts, getPost};

[Killed] ConditionalExpression
js_app/api/posts/posts.controller.js:6:17
 const getPost = (req) => post(req.params.id);
 
 const getAllPosts = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = true;
   const value = req && req.query && req.query.value;
   return allPosts({field, value})

[Killed] ConditionalExpression
js_app/api/posts/posts.controller.js:6:17
 const getPost = (req) => post(req.params.id);
 
 const getAllPosts = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = true && req.query.field;
   const value = req && req.query && req.query.value;
   return allPosts({field, value})
