[Killed] StringLiteral
js_app/api/posts/posts.endpoint.js:4:12
 const config = require('../../config');
 
 module.exports = {
-  baseURL: `${config.jsonplaceholder.domain}/posts`,
+  baseURL: "",
   timeout: 5000
 };
