[Killed] Block
js_app/api/posts/posts.model.js:7:44
 
 const post = client.getPost;
 
-const allPosts = async ({field, value}) => {
-  const posts = await client.getAllPosts();
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  if (field && value && !findValueByKeyInObject(postsFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const byFieldValue = filterByValue({field, value}, postsFormat);
-
-  if (byFieldValue) {
-    const response = posts.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  posts
-  }
-};
+const allPosts = async ({field, value}) => {};
 
 module.exports = {post, allPosts};

[Killed] PrefixUnaryExpression
js_app/api/posts/posts.model.js:10:29
 const allPosts = async ({field, value}) => {
   const posts = await client.getAllPosts();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((field && !value) || (field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field && value && !findValueByKeyInObject(postsFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] IfStatement
js_app/api/posts/posts.model.js:12:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(postsFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (true) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, postsFormat);

[Killed] ConditionalExpression
js_app/api/posts/posts.model.js:12:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(postsFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (true && !findValueByKeyInObject(postsFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, postsFormat);

[Killed] Block
js_app/api/posts/posts.model.js:22:10
     if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
     return response
 
-  } else {
-    return  posts
-  }
+  } else {}
 };
 

[Killed] ObjectLiteral
js_app/api/posts/posts.model.js:27:18
   }
 };
 
-module.exports = {post, allPosts};
+module.exports = {};
