[Killed] StringLiteral
js_app/api/posts/posts.routes.js:8:12
 const router = express.Router();
 
 router.get('/', respond(getAllPosts));
-router.get('/:id', respond(getPost));
+router.get("", respond(getPost));
 
 module.exports = router;
