[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.client.js:8:16
 
 const createSharedAlbum = (db, sharedAlbum) => db.collection('sharedAlbums')
   .insertOne(sharedAlbum)
-  .then(res => {
-    return {
-      result: 'ok',
-      inserted: res.ops[0]
-    }
-  });
+  .then(res => {});
 
 const addAlbumUser = (db, albumId, user) => db.collection('sharedAlbums')

[Killed] ObjectLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:9:12
 const createSharedAlbum = (db, sharedAlbum) => db.collection('sharedAlbums')
   .insertOne(sharedAlbum)
   .then(res => {
-    return {
-      result: 'ok',
-      inserted: res.ops[0]
-    }
+    return {}
   });
 

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:19:29
   .updateOne({_id: albumId, "sharingUsers.userId": {$ne: user.userId}}, {$push: {sharingUsers: user}});
 
 const removeAlbumUser = (db, albumId, userId) => db.collection('sharedAlbums')
-  .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$pull: {"sharingUsers": {"userId": userId}}});
+  .updateOne({_id: albumId, "": userId}, {$pull: {"sharingUsers": {"userId": userId}}});
 
 const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {

[Killed] ObjectLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:19:86
   .updateOne({_id: albumId, "sharingUsers.userId": {$ne: user.userId}}, {$push: {sharingUsers: user}});
 
 const removeAlbumUser = (db, albumId, userId) => db.collection('sharedAlbums')
-  .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$pull: {"sharingUsers": {"userId": userId}}});
+  .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$pull: {"sharingUsers": {}}});
 
 const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.client.js:21:74
 const removeAlbumUser = (db, albumId, userId) => db.collection('sharedAlbums')
   .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$pull: {"sharingUsers": {"userId": userId}}});
 
-const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {
-  const alter = {};
-  if (write !== undefined) {
-    alter["sharingUsers.$.permissions.write"] = write;
-  }
-  if (read !== undefined) {
-    alter["sharingUsers.$.permissions.read"] = read;
-  }
-
-  return db.collection('sharedAlbums')
-    .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$set: alter});
-};
+const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {};
 
 const findAlbumUsers = (db, albumId, permission) => {

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.client.js:23:7
 
 const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {
   const alter = {};
-  if (write !== undefined) {
+  if (true) {
     alter["sharingUsers.$.permissions.write"] = write;
   }

[Killed] BinaryExpression
js_app/api/sharedAlbums/sharedAlbums.client.js:23:7
 
 const changeAlbumUserPermissions = (db, albumId, userId, write, read) => {
   const alter = {};
-  if (write !== undefined) {
+  if (write === undefined) {
     alter["sharingUsers.$.permissions.write"] = write;
   }

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.client.js:26:7
   if (write !== undefined) {
     alter["sharingUsers.$.permissions.write"] = write;
   }
-  if (read !== undefined) {
+  if (true) {
     alter["sharingUsers.$.permissions.read"] = read;
   }

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.client.js:26:7
   if (write !== undefined) {
     alter["sharingUsers.$.permissions.write"] = write;
   }
-  if (read !== undefined) {
+  if (false) {
     alter["sharingUsers.$.permissions.read"] = read;
   }

[Killed] ObjectLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:31:63
   }
 
   return db.collection('sharedAlbums')
-    .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$set: alter});
+    .updateOne({_id: albumId, "sharingUsers.userId": userId}, {});
 };
 

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.client.js:34:53
     .updateOne({_id: albumId, "sharingUsers.userId": userId}, {$set: alter});
 };
 
-const findAlbumUsers = (db, albumId, permission) => {
-  const aggregators = [
-    {$match: {_id: albumId}},
-    {$unwind: "$sharingUsers"}
-  ];
-
-  if (permission) {
-    aggregators.push({
-      $match: {
-        ["sharingUsers.permissions." + permission]: true
-      }
-    });
-  }
-
-  aggregators.push({$project: {_id: "$sharingUsers.userId"}});
-
-  return db
-    .collection('sharedAlbums')
-    .aggregate(aggregators)
-    .toArray()
-    .then(res => res.map(e => e._id))
-};
+const findAlbumUsers = (db, albumId, permission) => {};
 
 module.exports = {

[Killed] ObjectLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:36:14
 
 const findAlbumUsers = (db, albumId, permission) => {
   const aggregators = [
-    {$match: {_id: albumId}},
+    {$match: {}},
     {$unwind: "$sharingUsers"}
   ];

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.client.js:40:19
     {$unwind: "$sharingUsers"}
   ];
 
-  if (permission) {
-    aggregators.push({
-      $match: {
-        ["sharingUsers.permissions." + permission]: true
-      }
-    });
-  }
+  if (permission) {}
 
   aggregators.push({$project: {_id: "$sharingUsers.userId"}});

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.client.js:40:7
     {$unwind: "$sharingUsers"}
   ];
 
-  if (permission) {
+  if (true) {
     aggregators.push({
       $match: {

[Killed] BooleanSubstitution
js_app/api/sharedAlbums/sharedAlbums.client.js:43:53
   if (permission) {
     aggregators.push({
       $match: {
-        ["sharingUsers.permissions." + permission]: true
+        ["sharingUsers.permissions." + permission]: false
       }
     });

[Killed] BinaryExpression
js_app/api/sharedAlbums/sharedAlbums.client.js:43:10
   if (permission) {
     aggregators.push({
       $match: {
-        ["sharingUsers.permissions." + permission]: true
+        ["sharingUsers.permissions." - permission]: true
       }
     });

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:48:37
     });
   }
 
-  aggregators.push({$project: {_id: "$sharingUsers.userId"}});
+  aggregators.push({$project: {_id: ""}});
 
   return db

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.client.js:51:17
   aggregators.push({$project: {_id: "$sharingUsers.userId"}});
 
   return db
-    .collection('sharedAlbums')
+    .collection("")
     .aggregate(aggregators)
     .toArray()
