[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.controller.js:11:45
   findAlbumUsers
 } = require('./sharedAlbums.model');
 
-const getSharedAlbum = db => async (req) => {
-  const value = await sharedAlbum(db, parseInt(req.params.id));
-  if(!value) {
-    throw { error: "Album not found", code: "not_found" };
-  }
-  return value;
-};
+const getSharedAlbum = db => async (req) => {};
 
 const getAllSharedAlbums = db => req => {

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.controller.js:13:14
 
 const getSharedAlbum = db => async (req) => {
   const value = await sharedAlbum(db, parseInt(req.params.id));
-  if(!value) {
-    throw { error: "Album not found", code: "not_found" };
-  }
+  if(!value) {}
   return value;
 };

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.controller.js:13:6
 
 const getSharedAlbum = db => async (req) => {
   const value = await sharedAlbum(db, parseInt(req.params.id));
-  if(!value) {
+  if(true) {
     throw { error: "Album not found", code: "not_found" };
   }

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.controller.js:14:20
 const getSharedAlbum = db => async (req) => {
   const value = await sharedAlbum(db, parseInt(req.params.id));
   if(!value) {
-    throw { error: "Album not found", code: "not_found" };
+    throw { error: "", code: "not_found" };
   }
   return value;

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.controller.js:19:41
   return value;
 };
 
-const getAllSharedAlbums = db => req => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allSharedAlbums(db, {field, value})
-};
+const getAllSharedAlbums = db => req => {};
 
 const createSharedAlbum = db =>

[Killed] ConditionalExpression
js_app/api/sharedAlbums/sharedAlbums.controller.js:20:17
 };
 
 const getAllSharedAlbums = db => req => {
-  const field = req && req.query && req.query.field;
+  const field = false;
   const value = req && req.query && req.query.value;
   return allSharedAlbums(db, {field, value})

[Killed] ConditionalExpression
js_app/api/sharedAlbums/sharedAlbums.controller.js:20:17
 };
 
 const getAllSharedAlbums = db => req => {
-  const field = req && req.query && req.query.field;
+  const field = false && req.query.field;
   const value = req && req.query && req.query.value;
   return allSharedAlbums(db, {field, value})
