[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:8:55
 
 const sharedAlbum = client.getSharedAlbum;
 
-const allSharedAlbums = async (db, {field, value}) => {
-  const albums = await client.getAllSharedAlbums(db);
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const byFieldValue = filterByValue({field, value}, albumFormat);
-
-  if (byFieldValue) {
-    const response = albums.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  albums
-  }
-};
+const allSharedAlbums = async (db, {field, value}) => {};
 
 const createSharedAlbumModel = async (db, sharedAlbum) => {

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:11:17
 const allSharedAlbums = async (db, {field, value}) => {
   const albums = await client.getAllSharedAlbums(db);
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((field && value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:13:25
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (field && value && findValueByKeyInObject(albumFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, albumFormat);

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:28:59
   }
 };
 
-const createSharedAlbumModel = async (db, sharedAlbum) => {
-  const hasUserId = sharedAlbum && sharedAlbum.userId;
-  const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
-
-  if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
-
-  let newSharingUsers = [];
-  if (sharedAlbum.sharingUsers) {
-    newSharingUsers = sharedAlbum.sharingUsers.map(e => {
-      if (!e.permissions) e.permissions = {read: true, write:false};
-      return e;
-    });
-  }
-  return client.createSharedAlbum(db, {...sharedAlbum, _id: sharedAlbum.albumId,  sharingUsers: newSharingUsers});
-};
+const createSharedAlbumModel = async (db, sharedAlbum) => {};
 
 const addAlbumUser = async (db, albumId, user) => {

[Killed] BinaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:29:21
 };
 
 const createSharedAlbumModel = async (db, sharedAlbum) => {
-  const hasUserId = sharedAlbum && sharedAlbum.userId;
+  const hasUserId = sharedAlbum || sharedAlbum.userId;
   const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
 

[Killed] ConditionalExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:29:21
 };
 
 const createSharedAlbumModel = async (db, sharedAlbum) => {
-  const hasUserId = sharedAlbum && sharedAlbum.userId;
+  const hasUserId = true;
   const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
 

[Killed] BinaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:30:22
 
 const createSharedAlbumModel = async (db, sharedAlbum) => {
   const hasUserId = sharedAlbum && sharedAlbum.userId;
-  const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
+  const hasAlbumId = sharedAlbum || sharedAlbum.albumId;
 
   if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};

[Killed] ConditionalExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:30:22
 
 const createSharedAlbumModel = async (db, sharedAlbum) => {
   const hasUserId = sharedAlbum && sharedAlbum.userId;
-  const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
+  const hasAlbumId = true;
 
   if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};

[Killed] BinaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:32:7
   const hasUserId = sharedAlbum && sharedAlbum.userId;
   const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
 
-  if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
+  if (!hasUserId && !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
 
   let newSharingUsers = [];

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.model.js:32:7
   const hasUserId = sharedAlbum && sharedAlbum.userId;
   const hasAlbumId = sharedAlbum && sharedAlbum.albumId;
 
-  if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
+  if (true) throw  {error: 'Missing required fields', code:'bad_format'};
 
   let newSharingUsers = [];

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.model.js:35:7
   if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
 
   let newSharingUsers = [];
-  if (sharedAlbum.sharingUsers) {
+  if (false) {
     newSharingUsers = sharedAlbum.sharingUsers.map(e => {
       if (!e.permissions) e.permissions = {read: true, write:false};

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:35:33
   if (!hasUserId || !hasAlbumId) throw  {error: 'Missing required fields', code:'bad_format'};
 
   let newSharingUsers = [];
-  if (sharedAlbum.sharingUsers) {
-    newSharingUsers = sharedAlbum.sharingUsers.map(e => {
-      if (!e.permissions) e.permissions = {read: true, write:false};
-      return e;
-    });
-  }
+  if (sharedAlbum.sharingUsers) {}
   return client.createSharedAlbum(db, {...sharedAlbum, _id: sharedAlbum.albumId,  sharingUsers: newSharingUsers});
 };

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:36:57
 
   let newSharingUsers = [];
   if (sharedAlbum.sharingUsers) {
-    newSharingUsers = sharedAlbum.sharingUsers.map(e => {
-      if (!e.permissions) e.permissions = {read: true, write:false};
-      return e;
-    });
+    newSharingUsers = sharedAlbum.sharingUsers.map(e => {});
   }
   return client.createSharedAlbum(db, {...sharedAlbum, _id: sharedAlbum.albumId,  sharingUsers: newSharingUsers});

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.model.js:37:11
   let newSharingUsers = [];
   if (sharedAlbum.sharingUsers) {
     newSharingUsers = sharedAlbum.sharingUsers.map(e => {
-      if (!e.permissions) e.permissions = {read: true, write:false};
+      if (false) e.permissions = {read: true, write:false};
       return e;
     });

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:37:11
   let newSharingUsers = [];
   if (sharedAlbum.sharingUsers) {
     newSharingUsers = sharedAlbum.sharingUsers.map(e => {
-      if (!e.permissions) e.permissions = {read: true, write:false};
+      if (e.permissions) e.permissions = {read: true, write:false};
       return e;
     });

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:44:51
   return client.createSharedAlbum(db, {...sharedAlbum, _id: sharedAlbum.albumId,  sharingUsers: newSharingUsers});
 };
 
-const addAlbumUser = async (db, albumId, user) => {
-  if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
-
-  if (!user.permissions) {
-    return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:false}})
-  }
-  return client.addAlbumUser(db, albumId, user);
-};
+const addAlbumUser = async (db, albumId, user) => {};
 
 const removeAlbumUser = async (db, albumId, userId) => {

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:45:19
 };
 
 const addAlbumUser = async (db, albumId, user) => {
-  if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
+  if (!albumId || user) throw {error: 'Missing required fields', code:'bad_format'};
 
   if (!user.permissions) {

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:45:7
 };
 
 const addAlbumUser = async (db, albumId, user) => {
-  if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
+  if (albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
 
   if (!user.permissions) {

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:47:26
 const addAlbumUser = async (db, albumId, user) => {
   if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
 
-  if (!user.permissions) {
-    return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:false}})
-  }
+  if (!user.permissions) {}
   return client.addAlbumUser(db, albumId, user);
 };

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.model.js:47:7
 const addAlbumUser = async (db, albumId, user) => {
   if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
 
-  if (!user.permissions) {
+  if (true) {
     return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:false}})
   }

[Killed] BooleanSubstitution
js_app/api/sharedAlbums/sharedAlbums.model.js:48:75
   if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
 
   if (!user.permissions) {
-    return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:false}})
+    return client.addAlbumUser(db, albumId, {...user, permissions: {read: false, write:false}})
   }
   return client.addAlbumUser(db, albumId, user);

[Killed] BooleanSubstitution
js_app/api/sharedAlbums/sharedAlbums.model.js:48:87
   if (!albumId || !user) throw {error: 'Missing required fields', code:'bad_format'};
 
   if (!user.permissions) {
-    return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:false}})
+    return client.addAlbumUser(db, albumId, {...user, permissions: {read: true, write:true}})
   }
   return client.addAlbumUser(db, albumId, user);

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:53:56
   return client.addAlbumUser(db, albumId, user);
 };
 
-const removeAlbumUser = async (db, albumId, userId) => {
-  if (!albumId || !userId) throw {error: 'Missing required fields', code:'bad_format'};
-
-  return client.removeAlbumUser(db, albumId, userId);
-};
+const removeAlbumUser = async (db, albumId, userId) => {};
 
 const changeAlbumUserPermissions = async(db, albumId, userId, {write, read}) => {

[Killed] IfStatement
js_app/api/sharedAlbums/sharedAlbums.model.js:54:7
 };
 
 const removeAlbumUser = async (db, albumId, userId) => {
-  if (!albumId || !userId) throw {error: 'Missing required fields', code:'bad_format'};
+  if (false) throw {error: 'Missing required fields', code:'bad_format'};
 
   return client.removeAlbumUser(db, albumId, userId);

[Killed] PrefixUnaryExpression
js_app/api/sharedAlbums/sharedAlbums.model.js:54:7
 };
 
 const removeAlbumUser = async (db, albumId, userId) => {
-  if (!albumId || !userId) throw {error: 'Missing required fields', code:'bad_format'};
+  if (albumId || !userId) throw {error: 'Missing required fields', code:'bad_format'};
 
   return client.removeAlbumUser(db, albumId, userId);

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:59:81
   return client.removeAlbumUser(db, albumId, userId);
 };
 
-const changeAlbumUserPermissions = async(db, albumId, userId, {write, read}) => {
-  return client.changeAlbumUserPermissions(db, albumId, userId, write, read);
-};
+const changeAlbumUserPermissions = async(db, albumId, userId, {write, read}) => {};
 
 const findAlbumUsers = async (db, albumId, permission) =>

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:65:29
 
 const findAlbumUsers = async (db, albumId, permission) =>
   client.findAlbumUsers(db, albumId, permission)
-    .then(sharingUserIds => {
-      return Promise.all(sharingUserIds.map(sharingUserId => {
-        return userService.user(sharingUserId);
-      }))
-    });
+    .then(sharingUserIds => {});
 
 

[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.model.js:66:62
 const findAlbumUsers = async (db, albumId, permission) =>
   client.findAlbumUsers(db, albumId, permission)
     .then(sharingUserIds => {
-      return Promise.all(sharingUserIds.map(sharingUserId => {
-        return userService.user(sharingUserId);
-      }))
+      return Promise.all(sharingUserIds.map(sharingUserId => {}))
     });
 
