[Killed] Block
js_app/api/sharedAlbums/sharedAlbums.routes.js:13:30
 } = require('./sharedAlbums.controller');
 const respond = require('../controller');
 
-const sharedRouter = (db) => {
-  const router = express.Router();
-
-  router.get('/', respond(getAllSharedAlbums(db)));
-  router.get('/:id', respond(getSharedAlbum(db)));
-  router.post('/', respond(createSharedAlbum(db)));
-  router.post('/:id/users', respond(addAlbumUserController(db)));
-  router.delete('/:id/users/:userId', respond(removeAlbumUserController(db)));
-  router.get('/:id/users', respond(findAlbumUsersController(db)));
-
-  router.patch('/:id/users/:userId/permissions', respond(changeAlbumUserPermissionsController(db)));
-
-  return router
-};
+const sharedRouter = (db) => {};
 
 module.exports = sharedRouter;

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.routes.js:16:14
 const sharedRouter = (db) => {
   const router = express.Router();
 
-  router.get('/', respond(getAllSharedAlbums(db)));
+  router.get("", respond(getAllSharedAlbums(db)));
   router.get('/:id', respond(getSharedAlbum(db)));
   router.post('/', respond(createSharedAlbum(db)));

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.routes.js:17:14
   const router = express.Router();
 
   router.get('/', respond(getAllSharedAlbums(db)));
-  router.get('/:id', respond(getSharedAlbum(db)));
+  router.get("", respond(getSharedAlbum(db)));
   router.post('/', respond(createSharedAlbum(db)));
   router.post('/:id/users', respond(addAlbumUserController(db)));

[Killed] StringLiteral
js_app/api/sharedAlbums/sharedAlbums.routes.js:21:14
   router.post('/', respond(createSharedAlbum(db)));
   router.post('/:id/users', respond(addAlbumUserController(db)));
   router.delete('/:id/users/:userId', respond(removeAlbumUserController(db)));
-  router.get('/:id/users', respond(findAlbumUsersController(db)));
+  router.get("", respond(findAlbumUsersController(db)));
 
   router.patch('/:id/users/:userId/permissions', respond(changeAlbumUserPermissionsController(db)));
