[Killed] StringLiteral
js_app/api/users/users.client.js:7:36
 
 const client = axios.create(endpoint);
 
-const getUser = (id) => client.get(`/${id}`).then(getData);
+const getUser = (id) => client.get("").then(getData);
 const getAllUsers = () => client.get('/').then(getData);
 

[Killed] StringLiteral
js_app/api/users/users.client.js:8:38
 const client = axios.create(endpoint);
 
 const getUser = (id) => client.get(`/${id}`).then(getData);
-const getAllUsers = () => client.get('/').then(getData);
+const getAllUsers = () => client.get("").then(getData);
 
 module.exports = {getUser, getAllUsers};
