[Killed] Block
js_app/api/users/users.controller.js:5:36
 
 const getUser = (req) => user(req.params.id);
 
-const getAllUsers = async (req) => {
-  const field = req && req.query && req.query.field;
-  const value = req && req.query && req.query.value;
-  return allUsers({field, value})
-};
+const getAllUsers = async (req) => {};
 
 module.exports = {getAllUsers, getUser};

[Killed] ConditionalExpression
js_app/api/users/users.controller.js:6:17
 const getUser = (req) => user(req.params.id);
 
 const getAllUsers = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = false;
   const value = req && req.query && req.query.value;
   return allUsers({field, value})

[Killed] ConditionalExpression
js_app/api/users/users.controller.js:6:17
 const getUser = (req) => user(req.params.id);
 
 const getAllUsers = async (req) => {
-  const field = req && req.query && req.query.field;
+  const field = false && req.query.field;
   const value = req && req.query && req.query.value;
   return allUsers({field, value})

[Survived] ObjectLiteral
js_app/api/users/users.controller.js:8:19
 const getAllUsers = async (req) => {
   const field = req && req.query && req.query.field;
   const value = req && req.query && req.query.value;
-  return allUsers({field, value})
+  return allUsers({})
 };
 
