[Killed] Block
js_app/api/users/users.model.js:7:44
 
 const user = client.getUser;
 
-const allUsers = async ({field, value}) => {
-  const comments = await client.getAllUsers();
-
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
-
-  if (field && value && !findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
-
-  const byFieldValue = filterByValue({field, value}, usersFormat);
-
-  if (byFieldValue) {
-    const response = comments.filter(byFieldValue);
-
-    if (response.length === 0) throw {error: 'No value matched criteria', code: 'not_found'};
-    return response
-
-  } else {
-    return  comments
-  }
-};
+const allUsers = async ({field, value}) => {};
 
 module.exports = {user, allUsers};

[Killed] ConditionalExpression
js_app/api/users/users.model.js:10:29
 const allUsers = async ({field, value}) => {
   const comments = await client.getAllUsers();
 
-  if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
+  if ((field && !value) || (false)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
   if (field && value && !findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};

[Killed] PrefixUnaryExpression
js_app/api/users/users.model.js:12:25
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (field && value && findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, usersFormat);

[Killed] BinaryExpression
js_app/api/users/users.model.js:12:7
 
   if ((field && !value) || (!field && value)) throw {error: 'Missing either field or value', code: 'bad_format'};
 
-  if (field && value && !findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
+  if (field && value || !findValueByKeyInObject(usersFormat, field)) throw {error: 'The property you are looking for does not exist in this resourse', code: 'bad_format'};
 
   const byFieldValue = filterByValue({field, value}, usersFormat);
