[Killed] ObjectLiteral
entrevista_wolox/js_app/utils/formats.js:1:23
-module.exports.user = {
-  id: 'number',
-  name: 'string',
-  username: 'string',
-  email: 'string',
-  address: {
-    street: 'string',
-    suite: 'string',
-    city: 'string',
-    zipcode: 'string',
-    geo: {
-      lat: 'string',
-      lng: 'string'
-    }
-  },
-  phone: 'string',
-  website: 'string',
-  company: {
-    name: 'string',
-    catchPhrase: 'string',
-    bs: 'string'
-  }
-};
+module.exports.user = {};
 
 module.exports.photo = {

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:2:7
 module.exports.user = {
-  id: 'number',
+  id: "",
   name: 'string',
   username: 'string',

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:8:12
   email: 'string',
   address: {
     street: 'string',
-    suite: 'string',
+    suite: "",
     city: 'string',
     zipcode: 'string',

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:9:11
   address: {
     street: 'string',
     suite: 'string',
-    city: 'string',
+    city: "",
     zipcode: 'string',
     geo: {

[Killed] ObjectLiteral
entrevista_wolox/js_app/utils/formats.js:11:10
     suite: 'string',
     city: 'string',
     zipcode: 'string',
-    geo: {
-      lat: 'string',
-      lng: 'string'
-    }
+    geo: {}
   },
   phone: 'string',

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:13:12
     zipcode: 'string',
     geo: {
       lat: 'string',
-      lng: 'string'
+      lng: ""
     }
   },

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:16:10
       lng: 'string'
     }
   },
-  phone: 'string',
+  phone: "",
   website: 'string',
   company: {

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:20:18
   website: 'string',
   company: {
     name: 'string',
-    catchPhrase: 'string',
+    catchPhrase: "",
     bs: 'string'
   }

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:27:7
 
 module.exports.photo = {
   albumId: 'number',
-  id: 'number',
+  id: "",
   title: 'string',
   url: 'string',

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:30:17
   id: 'number',
   title: 'string',
   url: 'string',
-  thumbnailUrl: 'string'
+  thumbnailUrl: ""
 };
 

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:35:7
 
 module.exports.album = {
   userId: 'number',
-  id: 'number',
+  id: "",
   title: 'string'
 };

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:36:10
 module.exports.album = {
   userId: 'number',
   id: 'number',
-  title: 'string'
+  title: ""
 };
 

[Killed] ObjectLiteral
entrevista_wolox/js_app/utils/formats.js:46:27
   body: 'string'
 };
 
-module.exports.comments = {
-  postId: 'number',
-  id: 'number',
-  name: 'string',
-  email: 'string',
-  body: 'string'
-};
+module.exports.comments = {};
 
 module.exports.sharedAlbums = {

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:47:11
 };
 
 module.exports.comments = {
-  postId: 'number',
+  postId: "",
   id: 'number',
   name: 'string',

[Killed] StringLiteral
entrevista_wolox/js_app/utils/formats.js:48:7
 
 module.exports.comments = {
   postId: 'number',
-  id: 'number',
+  id: "",
   name: 'string',
   email: 'string',

[Killed] ArrayLiteral
entrevista_wolox/js_app/utils/formats.js:57:17
 module.exports.sharedAlbums = {
   userId: 'number',
   albumId: 'number',
-  sharingUsers: [
-    {
-      userId: 'number',
-      permissions: {
-        read: true,
-        write: true
-      }
-    }
-  ]
+  sharingUsers: []
 };

[Killed] ObjectLiteral
entrevista_wolox/js_app/utils/formats.js:58:5
   userId: 'number',
   albumId: 'number',
   sharingUsers: [
-    {
-      userId: 'number',
-      permissions: {
-        read: true,
-        write: true
-      }
-    }
+    {}
   ]
 };

[Killed] BooleanSubstitution
entrevista_wolox/js_app/utils/formats.js:61:15
     {
       userId: 'number',
       permissions: {
-        read: true,
+        read: false,
         write: true
       }

[Killed] BooleanSubstitution
entrevista_wolox/js_app/utils/formats.js:62:16
       userId: 'number',
       permissions: {
         read: true,
-        write: true
+        write: false
       }
     }
