[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:3:69
 const expect = require('chai').expect;
 
-const isObjWithProps = obj => !!obj && !!Object.keys(obj).length && typeof obj === 'object' && !Array.isArray(obj);
+const isObjWithProps = obj => !!obj && !!Object.keys(obj).length && typeof obj !== 'object' && !Array.isArray(obj);
 
 const checkFormat = function cicle(proto, o) {

[Killed] PrefixUnaryExpression
entrevista_wolox/js_app/utils/index.js:3:40
 const expect = require('chai').expect;
 
-const isObjWithProps = obj => !!obj && !!Object.keys(obj).length && typeof obj === 'object' && !Array.isArray(obj);
+const isObjWithProps = obj => !!obj && !Object.keys(obj).length && typeof obj === 'object' && !Array.isArray(obj);
 
 const checkFormat = function cicle(proto, o) {

[Killed] Block
entrevista_wolox/js_app/utils/index.js:5:46
 
 const isObjWithProps = obj => !!obj && !!Object.keys(obj).length && typeof obj === 'object' && !Array.isArray(obj);
 
-const checkFormat = function cicle(proto, o) {
-  for (prop in proto) {
-    if (isObjWithProps(proto[prop])) {
-      cicle(proto[prop], o[prop])
-    } else {
-      expect(o).to.have.property(prop)
-    }
-  }
-};
+const checkFormat = function cicle(proto, o) {};
 
 const filterByValue = (filter, format) => {

[Killed] Block
entrevista_wolox/js_app/utils/index.js:6:23
 const isObjWithProps = obj => !!obj && !!Object.keys(obj).length && typeof obj === 'object' && !Array.isArray(obj);
 
 const checkFormat = function cicle(proto, o) {
-  for (prop in proto) {
-    if (isObjWithProps(proto[prop])) {
-      cicle(proto[prop], o[prop])
-    } else {
-      expect(o).to.have.property(prop)
-    }
-  }
+  for (prop in proto) {}
 };
 

[Killed] Block
entrevista_wolox/js_app/utils/index.js:7:38
 
 const checkFormat = function cicle(proto, o) {
   for (prop in proto) {
-    if (isObjWithProps(proto[prop])) {
-      cicle(proto[prop], o[prop])
-    } else {
+    if (isObjWithProps(proto[prop])) {} else {
       expect(o).to.have.property(prop)
     }

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:7:9
 
 const checkFormat = function cicle(proto, o) {
   for (prop in proto) {
-    if (isObjWithProps(proto[prop])) {
+    if (false) {
       cicle(proto[prop], o[prop])
     } else {

[Killed] Block
entrevista_wolox/js_app/utils/index.js:9:12
   for (prop in proto) {
     if (isObjWithProps(proto[prop])) {
       cicle(proto[prop], o[prop])
-    } else {
-      expect(o).to.have.property(prop)
-    }
+    } else {}
   }
 };

[Killed] Block
entrevista_wolox/js_app/utils/index.js:15:43
   }
 };
 
-const filterByValue = (filter, format) => {
-  const field = filter && filter.field;
-  const value = filter && filter.value;
-  if(!field && !!value) return null;
-
-  const type = findValueByKeyInObject(format, field);
-
-  return item => {
-    const val = type === 'number' ? parseInt(value):value;
-
-    return findValueByKeyInObject(item, field) === val;
-  };
-};
+const filterByValue = (filter, format) => {};
 
 const findValueByKeyInObject = (object, searchedKey) => {

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:16:17
 };
 
 const filterByValue = (filter, format) => {
-  const field = filter && filter.field;
+  const field = filter || filter.field;
   const value = filter && filter.value;
   if(!field && !!value) return null;

[Killed] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:16:17
 };
 
 const filterByValue = (filter, format) => {
-  const field = filter && filter.field;
+  const field = false;
   const value = filter && filter.value;
   if(!field && !!value) return null;

[Killed] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:17:17
 
 const filterByValue = (filter, format) => {
   const field = filter && filter.field;
-  const value = filter && filter.value;
+  const value = true;
   if(!field && !!value) return null;
 

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:17:17
 
 const filterByValue = (filter, format) => {
   const field = filter && filter.field;
-  const value = filter && filter.value;
+  const value = filter || filter.value;
   if(!field && !!value) return null;
 

[Killed] PrefixUnaryExpression
entrevista_wolox/js_app/utils/index.js:18:16
 const filterByValue = (filter, format) => {
   const field = filter && filter.field;
   const value = filter && filter.value;
-  if(!field && !!value) return null;
+  if(!field && !value) return null;
 
   const type = findValueByKeyInObject(format, field);

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:18:6
 const filterByValue = (filter, format) => {
   const field = filter && filter.field;
   const value = filter && filter.value;
-  if(!field && !!value) return null;
+  if(true) return null;
 
   const type = findValueByKeyInObject(format, field);

[Killed] Block
entrevista_wolox/js_app/utils/index.js:22:18
 
   const type = findValueByKeyInObject(format, field);
 
-  return item => {
-    const val = type === 'number' ? parseInt(value):value;
-
-    return findValueByKeyInObject(item, field) === val;
-  };
+  return item => {};
 };
 

[Killed] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:23:17
   const type = findValueByKeyInObject(format, field);
 
   return item => {
-    const val = type === 'number' ? parseInt(value):value;
+    const val = false ? parseInt(value):value;
 
     return findValueByKeyInObject(item, field) === val;

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:23:17
   const type = findValueByKeyInObject(format, field);
 
   return item => {
-    const val = type === 'number' ? parseInt(value):value;
+    const val = type !== 'number' ? parseInt(value):value;
 
     return findValueByKeyInObject(item, field) === val;

[Killed] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:25:12
   return item => {
     const val = type === 'number' ? parseInt(value):value;
 
-    return findValueByKeyInObject(item, field) === val;
+    return true;
   };
 };

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:25:12
   return item => {
     const val = type === 'number' ? parseInt(value):value;
 
-    return findValueByKeyInObject(item, field) === val;
+    return findValueByKeyInObject(item, field) !== val;
   };
 };

[Killed] Block
entrevista_wolox/js_app/utils/index.js:29:57
   };
 };
 
-const findValueByKeyInObject = (object, searchedKey) => {
-  if (object[searchedKey]) return object[searchedKey];
-
-  for (const key in object) {
-    if (key === searchedKey) {
-      return object[searchedKey];
-    } else if (object[key] instanceof Array || object[key] instanceof Object) {
-      return findValueByKeyInObject(object[key]);
-    }
-  }
-};
+const findValueByKeyInObject = (object, searchedKey) => {};
 
 const getRandomInRange = (min, max) => {

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:30:7
 };
 
 const findValueByKeyInObject = (object, searchedKey) => {
-  if (object[searchedKey]) return object[searchedKey];
+  if (false) return object[searchedKey];
 
   for (const key in object) {

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:30:7
 };
 
 const findValueByKeyInObject = (object, searchedKey) => {
-  if (object[searchedKey]) return object[searchedKey];
+  if (true) return object[searchedKey];
 
   for (const key in object) {

[Killed] Block
entrevista_wolox/js_app/utils/index.js:32:29
 const findValueByKeyInObject = (object, searchedKey) => {
   if (object[searchedKey]) return object[searchedKey];
 
-  for (const key in object) {
-    if (key === searchedKey) {
-      return object[searchedKey];
-    } else if (object[key] instanceof Array || object[key] instanceof Object) {
-      return findValueByKeyInObject(object[key]);
-    }
-  }
+  for (const key in object) {}
 };
 

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:33:9
   if (object[searchedKey]) return object[searchedKey];
 
   for (const key in object) {
-    if (key === searchedKey) {
+    if (true) {
       return object[searchedKey];
     } else if (object[key] instanceof Array || object[key] instanceof Object) {

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:33:9
   if (object[searchedKey]) return object[searchedKey];
 
   for (const key in object) {
-    if (key === searchedKey) {
+    if (false) {
       return object[searchedKey];
     } else if (object[key] instanceof Array || object[key] instanceof Object) {

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:35:16
   for (const key in object) {
     if (key === searchedKey) {
       return object[searchedKey];
-    } else if (object[key] instanceof Array || object[key] instanceof Object) {
+    } else if (true) {
       return findValueByKeyInObject(object[key]);
     }

[Killed] IfStatement
entrevista_wolox/js_app/utils/index.js:35:16
   for (const key in object) {
     if (key === searchedKey) {
       return object[searchedKey];
-    } else if (object[key] instanceof Array || object[key] instanceof Object) {
+    } else if (false) {
       return findValueByKeyInObject(object[key]);
     }

[Killed] Block
entrevista_wolox/js_app/utils/index.js:41:40
   }
 };
 
-const getRandomInRange = (min, max) => {
-  return Math.floor(Math.random() * (max - min) + min);
-};
+const getRandomInRange = (min, max) => {};
 
 const createFilter = (filterParams) => {

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:42:21
 };
 
 const getRandomInRange = (min, max) => {
-  return Math.floor(Math.random() * (max - min) + min);
+  return Math.floor(Math.random() * (max - min) - min);
 };
 

[Killed] BinaryExpression
entrevista_wolox/js_app/utils/index.js:42:38
 };
 
 const getRandomInRange = (min, max) => {
-  return Math.floor(Math.random() * (max - min) + min);
+  return Math.floor(Math.random() * (max + min) + min);
 };
 

[Killed] Block
entrevista_wolox/js_app/utils/index.js:45:40
   return Math.floor(Math.random() * (max - min) + min);
 };
 
-const createFilter = (filterParams) => {
-  const field = filterParams && filterParams.field;
-  let value = filterParams && filterParams.value;
-
-  return field && value
-    && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) === filterParams.value));
-};
+const createFilter = (filterParams) => {};
 
 const getData = e => e.data;

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:46:17
 };
 
 const createFilter = (filterParams) => {
-  const field = filterParams && filterParams.field;
+  const field = true;
   let value = filterParams && filterParams.value;
 

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:46:17
 };
 
 const createFilter = (filterParams) => {
-  const field = filterParams && filterParams.field;
+  const field = false;
   let value = filterParams && filterParams.value;
 

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:47:15
 
 const createFilter = (filterParams) => {
   const field = filterParams && filterParams.field;
-  let value = filterParams && filterParams.value;
+  let value = false;
 
   return field && value

[NoCoverage] BinaryExpression
entrevista_wolox/js_app/utils/index.js:47:15
 
 const createFilter = (filterParams) => {
   const field = filterParams && filterParams.field;
-  let value = filterParams && filterParams.value;
+  let value = filterParams || filterParams.value;
 
   return field && value

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:49:10
   const field = filterParams && filterParams.field;
   let value = filterParams && filterParams.value;
 
-  return field && value
-    && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) === filterParams.value));
+  return true;
 };
 

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:49:10
   const field = filterParams && filterParams.field;
   let value = filterParams && filterParams.value;
 
-  return field && value
+  return true
     && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) === filterParams.value));
 };

[NoCoverage] ConditionalExpression
entrevista_wolox/js_app/utils/index.js:50:45
   let value = filterParams && filterParams.value;
 
   return field && value
-    && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) === filterParams.value));
+    && (results => results.data.filter(e => true));
 };
 

[NoCoverage] BinaryExpression
entrevista_wolox/js_app/utils/index.js:50:45
   let value = filterParams && filterParams.value;
 
   return field && value
-    && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) === filterParams.value));
+    && (results => results.data.filter(e => findValueByKeyInObject(e, filterParams.field) !== filterParams.value));
 };
 
