[Killed] StringLiteral
dev/entrevista_wolox/js_app/config.js:10:11
   db:{
     host:'mongodb://localhost',
     port: '27017',
-    name: 'photoSharing-dev'
+    name: ""
   },
   testDb: {

[Killed] ConditionalExpression
dev/entrevista_wolox/js_app/config.js:23:18
 
 };
 
-module.exports = process.env.ENV === 'production' ? prod : dev;
+module.exports = false ? prod : dev;
