[NoCoverage] StringLiteral
dev/entrevista_wolox/js_app/index.js:2:24
 const config = require('./config');
-const server = require('./server');
+const server = require("");
 const MongoClient = require('mongodb').MongoClient;
 
