[Killed] Block
dev/entrevista_wolox/js_app/server.js:8:28
 const MongoClient = require('mongodb').MongoClient;
 
 module.exports = {
-  start: (port, dbData) => {
-    app.use('/api', bodyParser.json());
-    app.use('/api', bodyParser.urlencoded({extended:true}));
-
-    return MongoClient
-      .connect(`${dbData.host}:${dbData.port}`, { useNewUrlParser: true })
-      .then(client => {
-        const db = client.db(dbData.name);
-        app.use('/api', api(db));
-
-        return {app: app.listen(port), db, dbClient: client};
-      })
-      .then(({app, db, dbClient}) => {
-        console.log(`Server listening at port ${port}`);
-        return {app, db, dbClient};
-      });
-  }
+  start: (port, dbData) => {}
 };

[Killed] StringLiteral
dev/entrevista_wolox/js_app/server.js:9:13
 
 module.exports = {
   start: (port, dbData) => {
-    app.use('/api', bodyParser.json());
+    app.use("", bodyParser.json());
     app.use('/api', bodyParser.urlencoded({extended:true}));
 

[Killed] BooleanSubstitution
dev/entrevista_wolox/js_app/server.js:13:68
     app.use('/api', bodyParser.urlencoded({extended:true}));
 
     return MongoClient
-      .connect(`${dbData.host}:${dbData.port}`, { useNewUrlParser: true })
+      .connect(`${dbData.host}:${dbData.port}`, { useNewUrlParser: false })
       .then(client => {
         const db = client.db(dbData.name);

[Killed] Block
dev/entrevista_wolox/js_app/server.js:14:23
 
     return MongoClient
       .connect(`${dbData.host}:${dbData.port}`, { useNewUrlParser: true })
-      .then(client => {
-        const db = client.db(dbData.name);
-        app.use('/api', api(db));
-
-        return {app: app.listen(port), db, dbClient: client};
-      })
+      .then(client => {})
       .then(({app, db, dbClient}) => {
         console.log(`Server listening at port ${port}`);

[Killed] Block
dev/entrevista_wolox/js_app/server.js:20:38
 
         return {app: app.listen(port), db, dbClient: client};
       })
-      .then(({app, db, dbClient}) => {
-        console.log(`Server listening at port ${port}`);
-        return {app, db, dbClient};
-      });
+      .then(({app, db, dbClient}) => {});
   }
 };

[Killed] ObjectLiteral
dev/entrevista_wolox/js_app/server.js:22:16
       })
       .then(({app, db, dbClient}) => {
         console.log(`Server listening at port ${port}`);
-        return {app, db, dbClient};
+        return {};
       });
   }
