[NoCoverage] Block
dev/entrevista_wolox/js_app/stryker.conf.js:1:35
-module.exports = function(config) {
-  config.set({
-    mutator: "javascript",
-    packageManager: "npm",
-    reporters: ["html", "clear-text", "progress", "dashboard"],
-    testRunner: "mocha",
-    transpilers: [],
-    testFramework: "mocha",
-    coverageAnalysis: "perTest",
-    mutate: ["./api/**/*.js","./utils/**/*.js", "./*.js"],
-    files: ["./api/**/*.js","./utils/**/*.js", "./*.js","./test/*.js"]
-  });
-};
+module.exports = function(config) {};
 

[NoCoverage] ObjectLiteral
dev/entrevista_wolox/js_app/stryker.conf.js:2:14
 module.exports = function(config) {
-  config.set({
-    mutator: "javascript",
-    packageManager: "npm",
-    reporters: ["html", "clear-text", "progress", "dashboard"],
-    testRunner: "mocha",
-    transpilers: [],
-    testFramework: "mocha",
-    coverageAnalysis: "perTest",
-    mutate: ["./api/**/*.js","./utils/**/*.js", "./*.js"],
-    files: ["./api/**/*.js","./utils/**/*.js", "./*.js","./test/*.js"]
-  });
+  config.set({});
 };
 

[NoCoverage] StringLiteral
dev/entrevista_wolox/js_app/stryker.conf.js:6:17
     mutator: "javascript",
     packageManager: "npm",
     reporters: ["html", "clear-text", "progress", "dashboard"],
-    testRunner: "mocha",
+    testRunner: "",
     transpilers: [],
     testFramework: "mocha",

[NoCoverage] ArrayLiteral
dev/entrevista_wolox/js_app/stryker.conf.js:10:13
     transpilers: [],
     testFramework: "mocha",
     coverageAnalysis: "perTest",
-    mutate: ["./api/**/*.js","./utils/**/*.js", "./*.js"],
+    mutate: [],
     files: ["./api/**/*.js","./utils/**/*.js", "./*.js","./test/*.js"]
   });

[NoCoverage] StringLiteral
dev/entrevista_wolox/js_app/stryker.conf.js:10:30
     transpilers: [],
     testFramework: "mocha",
     coverageAnalysis: "perTest",
-    mutate: ["./api/**/*.js","./utils/**/*.js", "./*.js"],
+    mutate: ["./api/**/*.js","", "./*.js"],
     files: ["./api/**/*.js","./utils/**/*.js", "./*.js","./test/*.js"]
   });

[NoCoverage] StringLiteral
dev/entrevista_wolox/js_app/stryker.conf.js:11:57
     testFramework: "mocha",
     coverageAnalysis: "perTest",
     mutate: ["./api/**/*.js","./utils/**/*.js", "./*.js"],
-    files: ["./api/**/*.js","./utils/**/*.js", "./*.js","./test/*.js"]
+    files: ["./api/**/*.js","./utils/**/*.js", "./*.js",""]
   });
 };
