[Timeout] Block
ts_app/app/api/controller.ts:6:51
 export type ControllerFunction<T> = (req: Request) => Promise<T> | T;
 
 export function respond<T>(fn: ControllerFunction<T>): RequestHandler {
-    return async (req: Request, res: Response) => {
-        try {
-            const result = await fn(req);
-            res.json(result)
-        }
-
-        catch (error) {
-            console.error(error);
-            res.status(500);
-            res.json({error})
-        }
-    }
+    return async (req: Request, res: Response) => {}
 }
 

[Timeout] Block
ts_app/app/api/controller.ts:7:13
 
 export function respond<T>(fn: ControllerFunction<T>): RequestHandler {
     return async (req: Request, res: Response) => {
-        try {
-            const result = await fn(req);
-            res.json(result)
-        }
+        try {}
 
         catch (error) {

[Survived] Block
ts_app/app/api/controller.ts:12:23
             res.json(result)
         }
 
-        catch (error) {
-            console.error(error);
-            res.status(500);
-            res.json({error})
-        }
+        catch (error) {}
     }
 }

[Survived] ObjectLiteral
ts_app/app/api/controller.ts:15:22
         catch (error) {
             console.error(error);
             res.status(500);
-            res.json({error})
+            res.json({})
         }
     }
