[Survived] StringLiteral
app/api/users/users.client.ts:13:23
 };
 
 export const getUsers = (): Promise<User[]> => {
-    return client.get('/').then(getData)
+    return client.get("").then(getData)
 };
