[Killed] ArrowFunction
app/api/users/users.controller.ts:6:59
 import {user, users} from './users.service'
 import {User} from "../types/models";
 
-export const usersController:ControllerFunction<User[]> = (req: Request) =>
-    users();
+export const usersController:ControllerFunction<User[]> = () => undefined;
 
 export const userController:ControllerFunction<User> = (req: Request) =>

[Killed] ArrowFunction
app/api/users/users.controller.ts:9:56
 export const usersController:ControllerFunction<User[]> = (req: Request) =>
     users();
 
-export const userController:ControllerFunction<User> = (req: Request) =>
-    user(parseInt(req.params.id));
+export const userController:ControllerFunction<User> = () => undefined;
