[Killed] Block
app/api/users/users.service.ts:5:34
 import {User} from "../types/models";
 
 
-export const users = async () => {
-    const users: User[] = await getUsers();
-    return users
-
-};
+export const users = async () => {};
 
 export const user = async (userId:number) => {

[Killed] Block
app/api/users/users.service.ts:11:46
 
 };
 
-export const user = async (userId:number) => {
-    if (userId) {
-        const user: User = await getUser(userId) ;
-        return user;
-    } else {
-        throw {error: 'missing user id'}
-    }
-};
+export const user = async (userId:number) => {};

[Killed] IfStatement
app/api/users/users.service.ts:12:9
 };
 
 export const user = async (userId:number) => {
-    if (userId) {
+    if (false) {
         const user: User = await getUser(userId) ;
         return user;

[Killed] Block
app/api/users/users.service.ts:12:17
 };
 
 export const user = async (userId:number) => {
-    if (userId) {
-        const user: User = await getUser(userId) ;
-        return user;
-    } else {
+    if (userId) {} else {
         throw {error: 'missing user id'}
     }

[Survived] Block
app/api/users/users.service.ts:15:12
     if (userId) {
         const user: User = await getUser(userId) ;
         return user;
-    } else {
-        throw {error: 'missing user id'}
-    }
+    } else {}
 };

[Survived] StringLiteral
app/api/users/users.service.ts:16:23
         const user: User = await getUser(userId) ;
         return user;
     } else {
-        throw {error: 'missing user id'}
+        throw {error: ""}
     }
 };

[Survived] ObjectLiteral
app/api/users/users.service.ts:16:15
         const user: User = await getUser(userId) ;
         return user;
     } else {
-        throw {error: 'missing user id'}
+        throw {}
     }
 };
