[Survived] BooleanSubstitution
entrevista_wolox/ts_app/app/server.ts:10:53
     const app = express();
 
     app.use('/api', bodyParser.json());
-    app.use('/api', bodyParser.urlencoded({extended:true}));
+    app.use('/api', bodyParser.urlencoded({extended:false}));
     app.use('/api', routes());
 

[Survived] ObjectLiteral
entrevista_wolox/ts_app/app/server.ts:10:43
     const app = express();
 
     app.use('/api', bodyParser.json());
-    app.use('/api', bodyParser.urlencoded({extended:true}));
+    app.use('/api', bodyParser.urlencoded({}));
     app.use('/api', routes());
 

[Survived] Block
entrevista_wolox/ts_app/app/server.ts:13:35
     app.use('/api', bodyParser.urlencoded({extended:true}));
     app.use('/api', routes());
 
-    return app.listen(port, () => {
-        console.log(`Server listening at port ${port}`)
-    });
+    return app.listen(port, () => {});
 };
 

[Survived] StringLiteral
entrevista_wolox/ts_app/app/server.ts:14:21
     app.use('/api', routes());
 
     return app.listen(port, () => {
-        console.log(`Server listening at port ${port}`)
+        console.log("")
     });
 };
