[Killed] StringLiteral
ts_app/app/utils/config.ts:3:13
 export const config = {
     port: 3000,
-    domain: 'http://localhost',
+    domain: "",
     jsonplaceholder: {
         domain: "https://jsonplaceholder.typicode.com"

[Killed] ObjectLiteral
ts_app/app/utils/config.ts:4:22
 export const config = {
     port: 3000,
     domain: 'http://localhost',
-    jsonplaceholder: {
-        domain: "https://jsonplaceholder.typicode.com"
-    }
+    jsonplaceholder: {}
 };
 
