[Killed] ArrowFunction
ts_app/app/utils/helpers.ts:1:24
-export const getData = e => e.data;
+export const getData = () => undefined;
 
 export const getRandomPort = () => {

[Killed] Block
ts_app/app/utils/helpers.ts:3:36
 export const getData = e => e.data;
 
-export const getRandomPort = () => {
-    const max = 1025;
-    const min = 65534;
-
-    return Math.floor(Math.random() * (max - min) + min);
-};
+export const getRandomPort = () => {};

[Killed] BinaryExpression
ts_app/app/utils/helpers.ts:7:51
     const max = 1025;
     const min = 65534;
 
-    return Math.floor(Math.random() * (max - min) + min);
+    return Math.floor(Math.random() * (max - min) - min);
 };

[Killed] BinaryExpression
ts_app/app/utils/helpers.ts:7:44
     const max = 1025;
     const min = 65534;
 
-    return Math.floor(Math.random() * (max - min) + min);
+    return Math.floor(Math.random() * (max + min) + min);
 };
